"""Шаблоны сообщений бота."""

WELCOME_TEXT = (
    "Здравствуйте, я Бот который знакомит красивых людей и находит друзей по интересам 🥰"
)

HELP_LINES = [
    "Вас обслуживает бот сообщества VK Dating Bot. Я создан, чтобы знакомить красивых людей и находить друзей по интересам!",
    "Навигация по чату простая, и имеет всего несколько кнопок.",
    "--- 🟢 Главное меню --- С помощью главного меню вы активируете три кнопки. --- 🔎 Новый поиск --- или --- Продолжить просмотр ---, --- 🆘 Помощь --- и возможно еще появление кнопки --- 🆒 Избранное ---",
    "--- ▶️ Продолжить --- Мы продолжим действие, на котором остановились",
    "--- 🆘 Помощь --- Здесь я вас жду, чтобы помочь сориентироваться в навигации по чату.",
    "--- 🔎 Поиск --- Позволяет вам обновить свои предпочтения для поиска.",
    "--- 🆒 Избранное --- Позволяет вам просмотреть все понравившиеся аккаунты.",
    "--- ⏪ Назад --- Позволит вам вернуться к предыдущему пользователю.",
    "--- ⏩ Далее --- Позволит вам перейти к следующему пользователю.",
    "--- 🪪 К просмотру кандидатов --- Возвращаемся на страницу просмотра аккаунтов по вашим предпочтениям."
]

PREFERENCE_CITY_PROMPT = "Пожалуйста, напишите название города на русском языке."
PREFERENCE_GENDER_PROMPT = "Какой пол вас интересует?"
PREFERENCE_AGE_FROM_PROMPT = "Какой минимальный возраст вас интересует?"
PREFERENCE_AGE_TO_PROMPT = "Какой предельный возраст вас интересует?"
MAIN_MENU_TEXT = "Что вы хотите?"
